#+STARTUP: content showstars indent
#+FILETAGS: dnd charsheet Chewy Eshieldoor
#+TITLE: Chewy - Charsheet

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
  #+END_SRC

  #+RESULTS[fe869ac4a086dce7f213c7b51a3bd20bd6f5ef77]: define-constants-with-src-block
  :results:
  #+CONSTANTS: STR=19
  #+CONSTANTS: DEX=14
  #+CONSTANTS: CON=16
  #+CONSTANTS: INT=8
  #+CONSTANTS: WIS=12
  #+CONSTANTS: CHA=12
  #+CONSTANTS: PROF=4
  :end:
  
* Traits
  | Level | Race    | Subrace | Class     | Subclass           | Age | Alignment | Size            |
  |-------+---------+---------+-----------+--------------------+-----+-----------+-----------------|
  |     9 | Goliath |         | Barbarian | Bear Totem Warrior |  27 | Neutral   | Medium(340) 8FT |
  
* Stats  
  | Speed | Hit Points       | AC             | Throws      | Inspo | Hit dice | Exhaustion |
  |-------+------------------+----------------+-------------+-------+----------+------------|
  | 40 ft | 60/95 (d12 or 7) | 18 +1 (shield) | Save: Fail: |       |        7 |            |

* Skills
  #+name: stats
  | Ability | Score | Mod | PB | Roll      | Skill           |
  |---------+-------+-----+----+-----------+-----------------|
  | STR     |    19 |   4 | X  | 1d20 + 8  | Saving Throw    |
  |         |       |     | XX | 1d20 + 12 | Athletics       |
  |---------+-------+-----+----+-----------+-----------------|
  | DEX     |    14 |   2 |    | 1d20 + 2  | Saving Throw    |
  |         |       |     |    | 1d20 + 2  | Acrobatics      |
  |         |       |     |    | 1d20 + 2  | Sleight of Hand |
  |         |       |     |    | 1d20 + 2  | Stealth         |
  |---------+-------+-----+----+-----------+-----------------|
  | CON     |    16 |   3 | X  | 1d20 + 7  | Saving Throw    |
  |---------+-------+-----+----+-----------+-----------------|
  | INT     |     8 |  -1 |    | 1d20 + -1 | Saving Throw    |
  |         |       |     |    | 1d20 + -1 | Arcana          |
  |         |       |     |    | 1d20 + -1 | History         |
  |         |       |     |    | 1d20 + -1 | Investigation   |
  |         |       |     |    | 1d20 + -1 | Nature          |
  |         |       |     |    | 1d20 + -1 | Religion        |
  |---------+-------+-----+----+-----------+-----------------|
  | WIS     |    12 |   1 |    | 1d20 + 1  | Saving Throw    |
  |         |       |     |    | 1d20 + 1  | Animal Handling |
  |         |       |     |    | 1d20 + 1  | Insight         |
  |         |       |     |    | 1d20 + 1  | Medicine        |
  |         |       |     | X  | 1d20 + 5  | Perception      |
  |         |       |     | X  | 1d20 + 5  | Survival        |
  |---------+-------+-----+----+-----------+-----------------|
  | CHA     |    12 |   1 |    | 1d20 + 1  | Saving Throw    |
  |         |       |     |    | 1d20 + 1  | Deception       |
 |         |       |     | X  | 1d20 + 5  | Intimidation    |
  |         |       |     |    | 1d20 + 1  | Performance     |
  |         |       |     |    | 1d20 + 1  | Persuasion      |
  |---------+-------+-----+----+-----------+-----------------|
  | PROF    |     4 |     |    |           |                 |
  #+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
  #+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
  #+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
  #+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
  #+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
  #+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
  #+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))
 
* Attacks
  #+NAME: attacks
  | Weapon        | Ability | Prof | Type        | Die | Mod To Hit | Roll    |
  |---------------+---------+------+-------------+-----+------------+---------|
  | MourningSteel | STR     | X    | Bludgeoning | 1d4 |          8 | 0d2 + 4 |
  | Shield +1     | STR     | X    | Bludgeoning | 1d4 |          8 | 1d4 + 4 |
  | Javelin       | STR     | X    | Piercing    | 1d6 |          8 | 1d6 + 4 |
  | Hand Ax       | STR     | X    | Slashing    | 1d6 |          8 | 1d6 + 4 |
  | Whip          | STR     | X    | Slashing    | 1d4 |          8 | 1d4 + 4 |
  #+TBLFM: $6='(+ (if (string= $3 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
  #+TBLFM: $7='(concat $5 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))
 
* Proficiencies
  | Languages | Instruments | Tools | Armor   | Weapons |
  |-----------+-------------+-------+---------+---------|
  | Common    | Horn        |       | Light   | Simple  |
  | Giant     |             |       | Medium  | Martial |
  | Draconic  |             |       | Shields |         |

* Equipment
  | Name                              | Quantity | Cost (gp) | Weight (lbs) | Total Weight (lbs) | Total Cost (gp) |
  |-----------------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Bear Onesy                        |        1 |         0 |              |                  0 |               0 |
  | Breast plat(AC 14)                |        1 |       400 |              |                  0 |             400 |
  | Explorer Pack                     |        1 |         0 |            0 |                  0 |               0 |
  | Greater Healing Potions (4d4 + 4) |        1 |         0 |              |                  0 |               0 |
  | Gold Band from Kerry Red Spear    |        1 |         0 |              |                  0 |               0 |
  | Hand Ax                           |        2 |         0 |              |                  0 |               0 |
  | Hunter Trap                       |        1 |         0 |              |                  0 |               0 |
  | Map                               |        1 |       .05 |            0 |                  0 |            0.05 |
  | Javelins                          |        6 |         0 |            0 |                  0 |               0 |
  | Rock Hammer                       |        1 |         0 |              |                  0 |               0 |
  | Shield +1 (6ft tall)              |        2 |         0 |              |                  0 |               0 |
  | Shield (Mourningsteel)            |        1 |         0 |            0 |                  0 |               0 |
  | Traveler's Clothes                |        1 |         0 |              |                  0 |               0 |
  | 6 FT spear with silver spear tip  |        1 |         0 |              |                  0 |               0 |
  |-----------------------------------+----------+-----------+--------------+--------------------+-----------------|
  | Carry Capacity                    |      170 |           |              |                  0 |               0 |
  #+TBLFM: $5=($2 * $4)
  #+TBLFM: $6=($2 * $3)
  #+TBLFM: @29$5=vsum(@4$5..@29$5)
  #+TBLFM: @29$6=vsum(@4$6..@28$6)
  #+TBLFM: @29$2=($STR * 10)
 
** Money
| Copper | Silver | Electrum | Gold | Platinum | Total (Gold) |
|--------+--------+----------+------+----------+--------------|
|      0 |      0 |        0 |   14 |        0 |            0 |
#+TBLFM: $6=(($1 / 100) + ($2 / 10) + ($3 / 2) + $4 + ($5 * 10))

** Attunements
Mourningsteel Barricade

* Kill Tracking
1 kill is a point .5 is an assist. Keep Tracking!

29.5
